Tekla Open API Reference for Tekla Structures 2025
Operation.CreateBentPlateByParts Method (Part, Part, BentPlate.BendShape)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, ConnectiveGeometry, BentPlate.BendShape).
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static BentPlate CreateBentPlateByParts(
	Part part1,
	Part part2,
	BentPlate.BendShape bendShape
)
Public Shared Function CreateBentPlateByParts (
	part1 As Part,
	part2 As Part,
	bendShape As BentPlate.BendShape
) As BentPlate
Parameters
part1
Type: Tekla.Structures.Model.Part
One part used for creating the bent plate.
part2
Type: Tekla.Structures.Model.Part
The other part used for creating the bent plate.
bendShape
Type: Tekla.Structures.Model.BentPlate.BendShape
Shape of the bend (cylindrical or conical)
Return Value
Type: BentPlate
The bent plate object if successful, null otherwise.
Exceptions
Exception | Condition
ConnectiveGeometryException | Thrown if could not create ConnectiveGeometry instance.
ArgumentException | Thrown if received unsupported bent plate creation input.
See Also
Reference
Operation Class
CreateBentPlateByParts Overload
Tekla.Structures.Model.Operations Namespace